---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.AreaBasedLoadType
source: html/f96dd1ff-aec2-3baa-5e19-60556587299f.htm
---
# AreaBasedLoadType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.